[{"data":1,"prerenderedAt":567},["ShallowReactive",2],{"cbKJ465mlI":3},{"pageSetup":4,"sections":15},{"slug":5,"description":8,"keywords":9,"image":10,"title":14},{"current":6,"_type":7},"skiing-the-steepest-slope-engineering-at-a-fintech","slug","Clear Street is a cloud-native financial technology firm on a mission to modernize the brokerage ecosystem.",null,{"url":11,"width":12,"height":13},"https://cdn.sanity.io/images/40fnhjbe/production/e17a6b512cb54f95f734ce082a410d24b3979506-3840x2160.png",3840,2160,"Skiing the Steepest Slope: Engineering at a FinTech",{"header":16,"content":46,"footer":478},{"title":14,"date":17,"summary":8,"author":18,"category":42,"hello":45},"2022-02-09",{"slug":19,"_type":21,"name":22,"role":23,"_rev":24,"photo":25,"_id":39,"_updatedAt":40,"_createdAt":41},{"current":20,"_type":7},"victoria-jenkins","authors","Victoria Harinxma-Jenkins","Senior Marketing Associate","rKz7QgqoURN79CnQlN7KiM",{"alt":9,"hotspot":26,"asset":32,"url":35,"width":36,"height":37,"extension":38},{"y":27,"height":28,"_type":29,"width":30,"x":31},0.3903216078016492,0.6577341082537617,"sanity.imageHotspot",0.9994489253793725,0.49972446268968623,{"_ref":33,"_type":34},"image-fbb313652d7d0bbe8e61eb2997a6ef2e3bc4dba4-3000x4500-png","reference","https://cdn.sanity.io/images/40fnhjbe/production/fbb313652d7d0bbe8e61eb2997a6ef2e3bc4dba4-3000x4500.png",3000,4500,"png","HDYpJujF7Re3qdeulZkFFf","2024-05-28T20:18:26Z","2024-02-16T14:38:42Z",{"name":43,"colorSlug":44},"Engineering","engineering","world",{"legalText":47,"form":90,"type":119,"readingTime":120,"body":121,"references":450,"pressReleasesFootNote":451},[48,82],{"_key":49,"markDefs":50,"children":58,"_type":80,"style":81},"cd3115128082",[51,55],{"_key":52,"_type":53,"href":54},"10659f16c05f","link","https://brokercheck.finra.org/firm/summary/288933",{"href":56,"_key":57,"_type":53},"https://www.nfa.futures.org/BasicNet/basic-profile.aspx?nfaid=XCoGScQYyvw%3D","3c111ef5e988",[59,64,68,72,76],{"_type":60,"marks":61,"text":62,"_key":63},"span",[],"Clear Street does not provide investment, legal, regulatory, tax, or compliance advice. Consult professionals in these fields to address your specific circumstances. These materials are: (i) solely an overview of Clear Street’s products and services; (ii) provided for informational purposes only; and (iii) subject to change without notice or obligation to replace any information contained therein.\n\nProducts and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. Additional information about Clear Street is available on FINRA ","e217f565c4110",{"_type":60,"marks":65,"text":66,"_key":67},[52],"BrokerCheck","e217f565c4111",{"_type":60,"marks":69,"text":70,"_key":71},[],", including its Customer Relationship Summary and NFA ","e217f565c4112",{"marks":73,"text":74,"_key":75,"_type":60},[57],"BASIC | NFA (futures.org)","e217f565c4113",{"_type":60,"marks":77,"text":78,"_key":79},[],".\n‍\nCopyright © 2024 Clear Street LLC. All rights reserved. Clear Street and the Shield Logo are Registered Trademarks of Clear Street LLC\n","e217f565c4114","block","normal",{"markDefs":83,"children":84,"_type":80,"style":81,"_key":89},[],[85],{"_type":60,"marks":86,"text":87,"_key":88},[],"\n","a19adde9170f0","38805a72b34d",{"title":91,"slug":92,"fields":93},"Contact","contact",[94,100,105,110,114],{"errorMessage":95,"_type":96,"name":97,"label":98,"required":99},"Please add your full name","field.string","full-name","Full name",true,{"name":101,"label":102,"required":99,"errorMessage":103,"_type":104},"work-email","Work email","Invalid email","field.email",{"required":99,"errorMessage":106,"_type":107,"name":108,"label":109},"Please add your work phone","field.phone","work-phone","Work phone",{"name":111,"label":112,"required":99,"errorMessage":113,"_type":96},"company","Company","Please add your company",{"label":115,"required":116,"errorMessage":9,"_type":117,"name":118},"Message (optional)",false,"field.text","message","blog",11,[122,130,138,145,161,169,179,187,194,202,209,217,224,232,240,248,256,264,271,279,286,294,302,310,317,325,332,340,348,356,364,372,380,388,395,403,411,419,426,434,442],{"_key":123,"markDefs":124,"children":125,"_type":80,"style":81},"8dcc210cffd7",[],[126],{"marks":127,"text":128,"_key":129,"_type":60},[],"","8dcc210cffd70",{"_key":131,"markDefs":132,"children":133,"_type":80,"style":81},"f88031f91774",[],[134],{"_type":60,"marks":135,"text":136,"_key":137},[],"Clear Street recently welcomed Adam Wolff as an advisor to our engineering team. Adam has built his career around a passion for creating next-generation software at companies like Robinhood and Facebook, as well as at smaller start-ups like Laszlo Systems and his own venture, Sharegrove, Inc. (which Facebook acquired in 2010).","f88031f917740",{"style":81,"_key":139,"markDefs":140,"children":141,"_type":80},"4df999821aec",[],[142],{"marks":143,"text":128,"_key":144,"_type":60},[],"4df999821aec0",{"asset":146,"_type":148,"alt":149,"_key":150,"url":151,"hotspot":9,"children":9,"caption":152,"width":160,"height":160,"extension":38},{"_ref":147,"_type":34},"image-09219dbadea025e68d24492b3fb3e017e61c485a-390x390-png","figureNews","Adam Wolff","8adfca746d02","https://cdn.sanity.io/images/40fnhjbe/production/09219dbadea025e68d24492b3fb3e017e61c485a-390x390.png",[153],{"children":154,"_type":80,"style":81,"_key":158,"markDefs":159},[155],{"_type":60,"marks":156,"text":149,"_key":157},[],"46f44f5429a10","46f44f5429a1",[],390,{"children":162,"_type":80,"style":81,"_key":167,"markDefs":168},[163],{"_type":60,"marks":164,"text":165,"_key":166},[],"We spoke with Adam to learn more about what brought him into the fintech world, how engineers and financiers can partner to drive innovation, and what excites him about joining the team at Clear Street.","33c179f49d0d0","33c179f49d0d",[],{"style":170,"_key":171,"markDefs":172,"children":173,"_type":80},"h5","7d9b3571d163",[],[174],{"_key":175,"_type":60,"marks":176,"text":178},"7d9b3571d1630",[177],"strong","You came to Clear Street with a strong background in fintech. Which came first: the finance experience or the technology experience?",{"style":81,"_key":180,"markDefs":181,"children":182,"_type":80},"eb1666c5594e",[],[183],{"_type":60,"marks":184,"text":185,"_key":186},[],"Technology came first, though not through a traditional route. I didn’t study computer science in school. I studied filmmaking, but I was always interested in user experience and user interface. I taught myself to program, mostly front-end programming and script kiddy stuff using Adobe Flash. Steadily, I learned more and more about how software was built.","eb1666c5594e0",{"_key":188,"markDefs":189,"children":190,"_type":80,"style":81},"43e2def61bc3",[],[191],{"_type":60,"marks":192,"text":128,"_key":193},[],"43e2def61bc30",{"style":81,"_key":195,"markDefs":196,"children":197,"_type":80},"a5bcc2a12e09",[],[198],{"_type":60,"marks":199,"text":200,"_key":201},[],"I eventually built my own startup, which was acquired by Facebook in 2010. It was a messaging startup, so at Facebook I initially worked on messaging. That’s where I really got a taste of distributed systems and reliability. I started off being interested in the user experience, and what I found is that user experience depends on all the engineering behind it: the best user experience is something that works reliably and quickly. Ultimately, you have to go down to how the database works in order to get the experience that you’re trying to get.","a5bcc2a12e090",{"markDefs":203,"children":204,"_type":80,"style":81,"_key":208},[],[205],{"marks":206,"text":128,"_key":207,"_type":60},[],"b9792ab46b3b0","b9792ab46b3b",{"children":210,"_type":80,"style":81,"_key":215,"markDefs":216},[211],{"_type":60,"marks":212,"text":213,"_key":214},[],"I worked across a number of areas in my eight years at Facebook, including product infrastructure, where we built frameworks that would make it easier to develop products. The most successful and popular one of these was React, which was a front-end library for building user interfaces. This team also was responsible for GraphQL, for a lot of the JavaScript ecosystem that surrounds React in addition to native mobile frameworks.","ea5b762e43fe0","ea5b762e43fe",[],{"style":81,"_key":218,"markDefs":219,"children":220,"_type":80},"a7ba55532c5c",[],[221],{"marks":222,"text":128,"_key":223,"_type":60},[],"a7ba55532c5c0",{"markDefs":225,"children":226,"_type":80,"style":81,"_key":231},[],[227],{"_type":60,"marks":228,"text":229,"_key":230},[],"At some point I realized that Facebook had grown too big to move quickly, and rightly so. When you have a product that is that scale, you don’t want to change it quickly. So that was when I decided to move onto Robinhood and started to learn more about finance.","50c42d2d922b0","50c42d2d922b",{"children":233,"_type":80,"style":170,"_key":238,"markDefs":239},[234],{"_type":60,"marks":235,"text":236,"_key":237},[177],"You came to technology for user experience and discovered that engineering was really interesting. In a way, that is the Clear Street story. Traders are interested in the end results, the profiting and the strategy, and yet it turns out that the real challenge is the underlying engineering: the infrastructure, the clearing process.","91763744004f0","91763744004f",[],{"_key":241,"markDefs":242,"children":243,"_type":80,"style":81},"72c830d71568",[],[244],{"_type":60,"marks":245,"text":246,"_key":247},[],"Yes, and I think this is the story of everything that’s happening right now. So much of how the world works is being translated into software, and it really matters how that software works. Increasingly, things that used to be up to human discretion are being translated into software, and the details of how that software works make a huge difference. When you say “This is the deadline,” does it mean I start the process before the deadline, or I finish the process before the deadline? Is the database going to lock, or is it just an application thing and I can hack around it? It’s all these little details that impact our lives; every experience we have.","72c830d715680",{"markDefs":249,"children":250,"_type":80,"style":170,"_key":255},[],[251],{"marks":252,"text":253,"_key":254,"_type":60},[177],"Coming to finance via technology, when along the way did you come to recognize clearing as a self-contained thing that needed addressing, if at all?","e8c77a0aee090","e8c77a0aee09",{"markDefs":257,"children":258,"_type":80,"style":81,"_key":263},[],[259],{"_type":60,"marks":260,"text":261,"_key":262},[],"When I joined Robinhood, they had been working on a project to go self-clearing for almost a year. So that project was already running and the team had been building something very much off to the side.","7b8a081dce070","7b8a081dce07",{"style":81,"_key":265,"markDefs":266,"children":267,"_type":80},"8ba60d4af957",[],[268],{"_key":269,"_type":60,"marks":270,"text":128},"8ba60d4af9570",[],{"markDefs":272,"children":273,"_type":80,"style":81,"_key":278},[],[274],{"_type":60,"marks":275,"text":276,"_key":277},[],"At the time, Robinhood depended on Apex Clearing. So, the Robinhood team’s first deliverable was mostly a drop-in replacement for Apex, even in some cases replicating the bugs, the awkward file transfer protocols, and all that stuff, just so that they could change as few things at the same time as possible.","90483b9bcb880","90483b9bcb88",{"_key":280,"markDefs":281,"children":282,"_type":80,"style":81},"276ccf4400ee",[],[283],{"_type":60,"marks":284,"text":128,"_key":285},[],"276ccf4400ee0",{"markDefs":287,"children":288,"_type":80,"style":81,"_key":293},[],[289],{"_type":60,"marks":290,"text":291,"_key":292},[],"Helping that team to ship was one of the first things I did there. This involved going in on the weekends and figuring out how we would move custody, and how we would ingest all of the data from Apex. So that was how I started to learn about some of the complexities that arise in clearing and custody.","f3dd3b09705c0","f3dd3b09705c",{"_key":295,"markDefs":296,"children":297,"_type":80,"style":170},"79eb86203645",[],[298],{"_type":60,"marks":299,"text":300,"_key":301},[177],"What challenges did you discover as you moved into the fintech world? How did this differ from working at a more “traditional” technology firm?","79eb862036450",{"children":303,"_type":80,"style":81,"_key":308,"markDefs":309},[304],{"_type":60,"marks":305,"text":306,"_key":307},[],"In the fintech domain, you can’t write a line of code really without having a good understanding of all of the requirements that come to bear on that code. There are compliance requirements, financial requirements, and counterparty requirements, not to mention product requirements.","99472e23c0fb0","99472e23c0fb",[],{"children":311,"_type":80,"style":81,"_key":315,"markDefs":316},[312],{"_key":313,"_type":60,"marks":314,"text":128},"881faf2183f40",[],"881faf2183f4",[],{"_key":318,"markDefs":319,"children":320,"_type":80,"style":81},"543562a9d9be",[],[321],{"_type":60,"marks":322,"text":323,"_key":324},[],"As a comparison: at Facebook, there’s no accounting necessary for “likes.” There’s no governmental organization that tracks “likes.” You can’t even know how many likes something really has because different users see different things, by design. The number of “likes” for a post or a photo is just whatever Facebook says it is. However, there is a mutually agreed-upon accounting for dollars, and if you lose those, the users know, the SEC knows, and it can be really bad. Really bad.","543562a9d9be0",{"style":81,"_key":326,"markDefs":327,"children":328,"_type":80},"5767066ee8ef",[],[329],{"_type":60,"marks":330,"text":128,"_key":331},[],"5767066ee8ef0",{"children":333,"_type":80,"style":81,"_key":338,"markDefs":339},[334],{"_key":335,"_type":60,"marks":336,"text":337},"0cd9968903c60",[],"I think that if you want to ski on the steepest slope at the mountain, and there are plenty of engineers who want to do that, I think that fintech is an emerging answer. Because it’s arcane, the requirements are very demanding, rigorous, and quite hard to understand. Also, the bar for availability, reliability, and service quality is so high. You can’t be wrong, and you can’t be down no matter what happens. And that’s really, really hard.","0cd9968903c6",[],{"children":341,"_type":80,"style":170,"_key":346,"markDefs":347},[342],{"marks":343,"text":344,"_key":345,"_type":60},[177],"How does this play out in terms of the engineer’s experience: how they’re impacting people, what are the demands on them, and about the complexity of the operation itself?","e32d5174789e0","e32d5174789e",[],{"style":81,"_key":349,"markDefs":350,"children":351,"_type":80},"5f3c858284bc",[],[352],{"_type":60,"marks":353,"text":354,"_key":355},[],"Software mediates the way we interact with the world, and at the end of the day, I think every company will eventually be a software company. I don’t want to oversell what finance has to offer; I think it’s a different kind of software engineering from Facebook-variety consumer technology. Working on communication tools, it’s more like art; it’s more about how it makes you feel. In contrast, engineering something in order to meet very specific requirements is more analytical. In financial services, you don’t get to do some of these more exotic things, because so much of the work involves: “Hey, we actually just need to write all of these SQL queries and make sure they’re correct.” Whereas at Facebook it’s like: “Hey, we’re designing a new programming language because we think that’ll make us 1% more efficient and that could save us $100,000,000 a year.”","5f3c858284bc0",{"markDefs":357,"children":358,"_type":80,"style":170,"_key":363},[],[359],{"marks":360,"text":361,"_key":362,"_type":60},[177],"How would you characterize what you’re doing with Clear Street right now?","1fb328e6aa7f0","1fb328e6aa7f",{"children":365,"_type":80,"style":81,"_key":370,"markDefs":371},[366],{"_type":60,"marks":367,"text":368,"_key":369},[],"As an advisor, I bring additional perspective, mostly as an engineering leader who has a fair amount of experience coaching and helping engineering managers to level up. And there’s a lot of aspects to that, but the leverage point that I think is both very powerful and that I’m most familiar with is how the engineering manager corps operates.","cb9c4a8fdb0e0","cb9c4a8fdb0e",[],{"style":170,"_key":373,"markDefs":374,"children":375,"_type":80},"9903e2d00862",[],[376],{"_type":60,"marks":377,"text":378,"_key":379},[177],"Say someone’s coming to join Clear Street on the engineering side. Finance intrigues them, but they are a little intimidated. How do they come up to speed on financial matters?","9903e2d008620",{"_key":381,"markDefs":382,"children":383,"_type":80,"style":81},"052f7e283566",[],[384],{"marks":385,"text":386,"_key":387,"_type":60},[],"First of all, I think the domain is too big for anyone to fully wrap their arms around it. In my opinion, the best thing to do is to pair with someone who has specific expertise on the operations side. Having the engineers shadow the operations people is valuable because that gives the difference between the theory and the practice. I think that pairing crystallizes the difference between: “Someone told me we need this report” versus seeing someone use the report, noticing how they always sort it by a certain column and realizing: “Hey, I could improve your workflow by changing this report in these ways”","052f7e2835660",{"_key":389,"markDefs":390,"children":391,"_type":80,"style":81},"58dbf550c035",[],[392],{"_type":60,"marks":393,"text":128,"_key":394},[],"58dbf550c0350",{"markDefs":396,"children":397,"_type":80,"style":81,"_key":402},[],[398],{"_type":60,"marks":399,"text":400,"_key":401},[],"When you put the engineers and the operations people together, magic happens because the operations people say: “I don’t know why this button doesn’t work.” And the engineers say: “Oh, I do. I can fix it.” And those things don’t always happen quickly otherwise. I’ve seen a lot of success when you tell your engineers, : “Hey, here’s your friend who runs our margin desk. You guys are going to pair together and you’re going to learn everything there is to know about margin.” And then once you learn margin, that’s a window into everything else that’s happening in clearing. You can identify the pieces from the details of one part of it.","39f51861bebd0","39f51861bebd",{"style":170,"_key":404,"markDefs":405,"children":406,"_type":80},"88eaca99313a",[],[407],{"_type":60,"marks":408,"text":409,"_key":410},[177],"What are the trends in financial technology that people should be paying attention to right now?","88eaca99313a0",{"style":81,"_key":412,"markDefs":413,"children":414,"_type":80},"b2582d77574e",[],[415],{"text":416,"_key":417,"_type":60,"marks":418},"I think that security and privacy will need to grow even faster than tech in general over the next ten years. I think it’ll hit fintech hardest and first because of regulatory pressure.","b2582d77574e0",[],{"style":81,"_key":420,"markDefs":421,"children":422,"_type":80},"a613b91e5e51",[],[423],{"_type":60,"marks":424,"text":128,"_key":425},[],"a613b91e5e510",{"children":427,"_type":80,"style":81,"_key":432,"markDefs":433},[428],{"_type":60,"marks":429,"text":430,"_key":431},[],"As our world becomes more software-mediated, being better about software security will be more and more important. Security has to go from being a reviewer checkpoint or restraint to something that is built-in and totally default. I have a very deep conviction that the only end state for security is to store all data encrypted by keys that are held by the user. The only truly safe way to handle data is to not have it in the first place. We’ve already seen this with credit card numbers, but it hasn’t pervaded enough and I don’t think that security culture has gotten all the way through to the typical engineering team.","659b032930f70","659b032930f7",[],{"_key":435,"markDefs":436,"children":437,"_type":80,"style":170},"e08b142114f6",[],[438],{"_key":439,"_type":60,"marks":440,"text":441},"e08b142114f60",[177],"Clearly there’s a lot of work to do, and we’re hiring. Why should a prospective employee take a closer look at Clear Street?",{"_type":80,"style":81,"_key":443,"markDefs":444,"children":445},"81746e65b12b",[],[446],{"_type":60,"marks":447,"text":448,"_key":449},[],"I’ve worked with a bunch of fintech firms, and one of the really distinguishing characteristics of Clear Street is its deep bench on the trading side. I think a lot of these new fintech firms are coming to finance with the POV of “I’m a technologist, that’s the hard part, and I can just learn the domain.” But finance simply isn’t something you can learn cold. Even people working in the industry their whole lives don’t know everything about it. Finance really requires teamwork to deliver for the customer. Clear Street has the foundations of a great cross-functional team, but we need your help.\n","81746e65b12b0",[],[452,460],{"markDefs":453,"children":454,"_type":80,"style":81,"_key":459},[],[455],{"marks":456,"text":457,"_key":458,"_type":60},[177],"About Clear Street:","820e76cb468a0","01d9743bd6e6",{"style":81,"_key":461,"markDefs":462,"children":466,"_type":80},"6558fb161935",[463],{"_type":53,"href":464,"_key":465},"https://clearstreet.io","f69e401d33e9",[467,471,474],{"text":468,"_key":469,"_type":60,"marks":470},"Clear Street is modernizing the brokerage ecosystem with financial technology and services that empower market participants with real-time data and best-in-class products, tools and teams, to navigate capital markets around the world. Complemented by white-glove service, Clear Street's cloud-native, proprietary product suite delivers financing, derivatives, execution and more to power client success, adding efficiency to the market and enabling clients to minimize risk, redundancy and cost. Clear Street’s goal is to create a single platform for every asset class, in every country and in any currency. For more information, visit ","46cc6bc340df0",[],{"_type":60,"marks":472,"text":464,"_key":473},[465],"46cc6bc340df1",{"_type":60,"marks":475,"text":476,"_key":477},[],".","46cc6bc340df2",{"legalText":9,"socialNetworks":479,"address":497,"disclaimer":498,"footerItems":525,"legalItems":557},[480,485,489,493],{"_type":481,"link":482,"socialNetwork":483,"_key":484},"links","https://github.com/clear-street","github","466192507eea",{"_type":481,"link":486,"socialNetwork":487,"_key":488},"https://www.linkedin.com/company/clear-street","linkedin","43f9fa8f49d0",{"_type":481,"link":490,"socialNetwork":491,"_key":492},"https://www.youtube.com/@ClearStreetNYC","youtube","b581a744d770",{"_type":481,"link":494,"socialNetwork":495,"_key":496},"https://open.spotify.com/show/3Bbl6x17ZSdnijTTDq6tKi","spotify","7625c0ffc2b2","4 World Trade Center\n150 Greenwich St Floor 45\nNew York, NY 10007\n(646) 845-0036",[499,509],{"children":500,"_type":80,"style":81,"_key":505,"markDefs":506},[501],{"marks":502,"text":503,"_key":504,"_type":60},[],"Products and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. ","331699fdb6140","b41b74ae73bb",[507],{"_type":53,"href":54,"_key":508},"d38625939708",{"style":81,"_key":510,"markDefs":511,"children":513,"_type":80},"dbec5081eda7",[512],{"href":54,"_key":508,"_type":53},[514,518,521],{"marks":515,"text":516,"_key":517,"_type":60},[],"Additional information about Clear Street is available on FINRA ","42e587e4d749",{"_type":60,"marks":519,"text":66,"_key":520},[508],"4894062c01ca",{"_type":60,"marks":522,"text":523,"_key":524},[],", including its Customer Relationship Summary and NFA BASIC | NFA (futures.org).","6db9006e1b4a",[526,539,551],{"title":112,"pages":527},[528,532,535,538],{"type":529,"title":530,"slug":531},"internal","About","about",{"type":529,"title":533,"slug":534},"News & Content","news",{"type":529,"title":536,"slug":537},"Careers","careers",{"type":529,"title":91,"slug":92},{"title":540,"pages":541},"Services",[542,545,548],{"type":529,"title":543,"slug":544},"Institutional","institutional",{"type":529,"title":546,"slug":547},"Professional Clearing","professional-clearing",{"type":529,"title":549,"slug":550},"Active Trader","active-trader",{"title":552,"pages":553},"Products",[554],{"type":529,"title":555,"slug":556},"Studio","studio",[558,561,564],{"title":559,"slug":560},"Regulatory Disclosures","regulatory-disclosures",{"title":562,"slug":563},"Privacy Policy","privacy-policy",{"title":565,"slug":566},"Security","security",1733511759012]