[{"data":1,"prerenderedAt":604},["ShallowReactive",2],{"1P5t4m1mQx":3},{"pageSetup":4,"sections":15},{"title":5,"slug":6,"description":9,"keywords":10,"image":11},"From COBOL to the Cloud: Q&A With Product SME Mohammed Arshad",{"current":7,"_type":8},"how-microservices-are-revolutionizing-trading-a-q-a-with-mohammed-arshad","slug","Clear Street is a cloud-native financial technology firm on a mission to modernize the brokerage ecosystem.",null,{"url":12,"width":13,"height":14},"https://cdn.sanity.io/images/40fnhjbe/production/91b9ca8d49a47c34244626e6e286a1ff8d1e4666-3840x2160.png",3840,2160,{"header":16,"content":46,"footer":515},{"author":17,"category":41,"title":5,"date":44,"summary":9,"hello":45},{"slug":18,"_createdAt":20,"_id":21,"_updatedAt":22,"photo":23,"_rev":37,"name":38,"role":39,"_type":40},{"current":19,"_type":8},"victoria-jenkins","2024-02-16T14:38:42Z","HDYpJujF7Re3qdeulZkFFf","2024-05-28T20:18:26Z",{"height":24,"extension":25,"alt":10,"hotspot":26,"asset":32,"url":35,"width":36},4500,"png",{"_type":27,"width":28,"x":29,"y":30,"height":31},"sanity.imageHotspot",0.9994489253793725,0.49972446268968623,0.3903216078016492,0.6577341082537617,{"_ref":33,"_type":34},"image-fbb313652d7d0bbe8e61eb2997a6ef2e3bc4dba4-3000x4500-png","reference","https://cdn.sanity.io/images/40fnhjbe/production/fbb313652d7d0bbe8e61eb2997a6ef2e3bc4dba4-3000x4500.png",3000,"rKz7QgqoURN79CnQlN7KiM","Victoria Harinxma-Jenkins","Senior Marketing Associate","authors",{"name":42,"colorSlug":43},"Engineering","engineering","2021-01-28","world",{"legalText":47,"form":90,"type":119,"readingTime":120,"body":121,"references":487,"pressReleasesFootNote":488},[48,82],{"_type":49,"style":50,"_key":51,"markDefs":52,"children":60},"block","normal","cd3115128082",[53,57],{"_type":54,"href":55,"_key":56},"link","https://brokercheck.finra.org/firm/summary/288933","10659f16c05f",{"_type":54,"href":58,"_key":59},"https://www.nfa.futures.org/BasicNet/basic-profile.aspx?nfaid=XCoGScQYyvw%3D","3c111ef5e988",[61,66,70,74,78],{"_type":62,"marks":63,"text":64,"_key":65},"span",[],"Clear Street does not provide investment, legal, regulatory, tax, or compliance advice. Consult professionals in these fields to address your specific circumstances. These materials are: (i) solely an overview of Clear Street’s products and services; (ii) provided for informational purposes only; and (iii) subject to change without notice or obligation to replace any information contained therein.\n\nProducts and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. Additional information about Clear Street is available on FINRA ","e217f565c4110",{"_key":67,"_type":62,"marks":68,"text":69},"e217f565c4111",[56],"BrokerCheck",{"_type":62,"marks":71,"text":72,"_key":73},[],", including its Customer Relationship Summary and NFA ","e217f565c4112",{"marks":75,"text":76,"_key":77,"_type":62},[59],"BASIC | NFA (futures.org)","e217f565c4113",{"marks":79,"text":80,"_key":81,"_type":62},[],".\n‍\nCopyright © 2024 Clear Street LLC. All rights reserved. Clear Street and the Shield Logo are Registered Trademarks of Clear Street LLC\n","e217f565c4114",{"markDefs":83,"children":84,"_type":49,"style":50,"_key":89},[],[85],{"_type":62,"marks":86,"text":87,"_key":88},[],"\n","a19adde9170f0","38805a72b34d",{"title":91,"slug":92,"fields":93},"Contact","contact",[94,100,105,110,114],{"name":95,"label":96,"required":97,"errorMessage":98,"_type":99},"full-name","Full name",true,"Please add your full name","field.string",{"name":101,"label":102,"required":97,"errorMessage":103,"_type":104},"work-email","Work email","Invalid email","field.email",{"_type":106,"name":107,"label":108,"required":97,"errorMessage":109},"field.phone","work-phone","Work phone","Please add your work phone",{"label":111,"required":97,"errorMessage":112,"_type":99,"name":113},"Company","Please add your company","company",{"name":115,"label":116,"required":117,"errorMessage":10,"_type":118},"message","Message (optional)",false,"field.text","blog",15,[122,132,139,147,154,162,172,180,187,195,202,210,217,225,233,241,248,256,264,272,280,288,295,303,310,318,325,333,341,349,356,364,371,379,386,394,402,410,418,426,434,442,449,457,464,472,479],{"caption":123,"_key":124,"height":125,"children":10,"_type":126,"alt":127,"width":128,"extension":25,"hotspot":10,"url":129,"asset":130},[],"c8e5be2bbbca",753,"figureNews","",1400,"https://cdn.sanity.io/images/40fnhjbe/production/3dff08cd5d7d25e8c93b4055629a6b3310106c09-1400x753.png",{"_ref":131,"_type":34},"image-3dff08cd5d7d25e8c93b4055629a6b3310106c09-1400x753-png",{"markDefs":133,"children":134,"_type":49,"style":50,"_key":138},[],[135],{"_type":62,"marks":136,"text":127,"_key":137},[],"b270e9c7984c0","b270e9c7984c",{"markDefs":140,"children":141,"_type":49,"style":50,"_key":146},[],[142],{"text":143,"_key":144,"_type":62,"marks":145},"This isn’t the first time we’ve built a clearing service. In fact, some of our most experienced team members, such as Mohammed Arshad, a highly accomplished Clear Street engineer, have been coding clearing from the very beginning, bringing nearly half a century of skills to our endeavor. Mo codes the posting rules for our clearing engine. He also guides the design and development of the core clearing system.","48a4a38216770",[],"48a4a3821677",{"children":148,"_type":49,"style":50,"_key":152,"markDefs":153},[149],{"_type":62,"marks":150,"text":127,"_key":151},[],"1a1c446992560","1a1c44699256",[],{"_key":155,"markDefs":156,"children":157,"_type":49,"style":50},"0afd1f6ac2da",[],[158],{"_type":62,"marks":159,"text":160,"_key":161},[],"In this Clear Street Q&A, we talk with Mo about how he moved clearing from COBOL to the cloud — and from independent service to monolithic ones and then back again. Mo lays out how the industry has benefited (and learned) from each stage of innovation, and how Clear Street’s combination of microservices and messaging will revolutionize fintech.","0afd1f6ac2da0",{"_key":163,"markDefs":164,"children":165,"_type":49,"style":171},"2d2f8ef9d38b",[],[166],{"marks":167,"text":169,"_key":170,"_type":62},[168],"strong","What was the earliest clearing system you helped build?","2d2f8ef9d38b0","h5",{"_type":49,"style":50,"_key":173,"markDefs":174,"children":175},"7ae4b56077af",[],[176],{"_type":62,"marks":177,"text":178,"_key":179},[],"The original version we had was written in COBOL. This was a traditional clearing system in the late 80s, very similar to what the big banks use. The companies that have been on the street for the longest time built their systems at around the same time, a little bit earlier than I was building my first version. These were all based on mainframes and were built with a closed mindset: a siloed set of functions that was very narrow in its scope.","7ae4b56077af0",{"children":181,"_type":49,"style":50,"_key":185,"markDefs":186},[182],{"marks":183,"text":127,"_key":184,"_type":62},[],"510cf254da410","510cf254da41",[],{"_key":188,"markDefs":189,"children":190,"_type":49,"style":50},"a831f428007e",[],[191],{"_type":62,"marks":192,"text":193,"_key":194},[],"For example, we had one system that did trade capture, and that’s all it did. It didn’t understand anything about what that trade meant downstream, or what had happened previously in the process. This one system got trades, it stored them, and it made them available downstream. That’s all it did. The settlement engine was a totally independent piece that would then use the data that the trading book guy had built, eventually via databases, but at first just using flat files.","a831f428007e0",{"style":50,"_key":196,"markDefs":197,"children":198,"_type":49},"f61deac4878c",[],[199],{"marks":200,"text":127,"_key":201,"_type":62},[],"f61deac4878c0",{"children":203,"_type":49,"style":50,"_key":208,"markDefs":209},[204],{"text":205,"_key":206,"_type":62,"marks":207},"The next part of the clearing process was what we call the matching piece of clearing: matching the trades against what was known on the street. Traditionally this was called purchase and sales. The P&S team would have their own system, usually written by a different team than the team that wrote the trade capture, meaning the two systems didn’t always see eye to eye. You ended up needing what was called a reconciliation. The trade capture system would say, “Hey, I got a hundred trades today in our systems alone.” The P&S system would reply, “I got 99.” There was always this additional work that you would have to do to make sure that all the pieces within the process were all talking together and not dropping things along the way.","de05ded64fd60",[],"de05ded64fd6",[],{"markDefs":211,"children":212,"_type":49,"style":50,"_key":216},[],[213],{"_type":62,"marks":214,"text":127,"_key":215},[],"6d182987ccf00","6d182987ccf0",{"children":218,"_type":49,"style":50,"_key":223,"markDefs":224},[219],{"text":220,"_key":221,"_type":62,"marks":222},"And the complications didn’t end there. Then there would be the cage system, which talked to DTCC and did the actual settlements with the real world. That, too, would be a separate system, requiring yet another reconciliation with the P&S system. So we’re talking about at least three systems. Beyond that there was all the reporting and so on, regulatory, all the other systems. Each was built as a separate self-contained system. In some cases they even had their own separate security masters, which was highly inefficient. There were so many reconciliations. That was the first iteration of automated clearing systems. They were very fragmented, with a lot of gaps in between them, and they were very unwieldy.","feee43c540500",[],"feee43c54050",[],{"markDefs":226,"children":227,"_type":49,"style":171,"_key":232},[],[228],{"_type":62,"marks":229,"text":230,"_key":231},[168],"When it was time to build the next generation of clearing systems, what changed?","943fb98767ea0","943fb98767ea",{"_type":49,"style":50,"_key":234,"markDefs":235,"children":236},"2ddab1abc80b",[],[237],{"marks":238,"text":239,"_key":240,"_type":62},[],"The next iteration began with the understanding that the prior fragmentation made zero sense. What value was there to all those different data sources? Why would anyone want to have all these different little systems that all have to talk to each other and communicate through files and databases? The second iteration was supposed to be the silver bullet: Let’s have a central database that is the single source of truth for all the data. In theory, it’s a great idea. Trade capture is written to the same database that the P&S matching system is done off of, and that the cage system is interacting with, et cetera, et cetera.","2ddab1abc80b0",{"markDefs":242,"children":243,"_type":49,"style":50,"_key":247},[],[244],{"text":127,"_key":245,"_type":62,"marks":246},"644300a135220",[],"644300a13522",{"markDefs":249,"children":250,"_type":49,"style":50,"_key":255},[],[251],{"_key":252,"_type":62,"marks":253,"text":254},"63f6df963d5d0",[],"This was the end of reconciliation, and of fragmentation. That was a huge leap, and that got us a long way. This era of system still works, to this day. The last iteration that I did is still running, and it’s going strong. That system does 10 million trades a day without missing a heartbeat. It’s good in terms of its functionality. The big drawback is you’ve got this huge monolith of a system. Where you had small fragmented systems that were all talking separately, now you have this big monolith, which is a monster. It’s all living on one big server, and when you need it to manage more trades, you have to put it on a bigger and bigger and bigger machine. It’s not very scalable.","63f6df963d5d",{"children":257,"_type":49,"style":171,"_key":262,"markDefs":263},[258],{"_type":62,"marks":259,"text":260,"_key":261},[168],"So, the silver bullet of a single unified system in this second generation of clearing wasn’t what it seemed?","58ee39d6f8150","58ee39d6f815",[],{"children":265,"_type":49,"style":50,"_key":270,"markDefs":271},[266],{"_type":62,"marks":267,"text":268,"_key":269},[],"Precisely, because big monolithic systems tend to fall down. They fail because all these operations are in one place, on one machine, contending with each other. There’s a big maintenance problem with that. You have this one big application, and if you touch one part of it, you’re very likely to break something else, something you have no intention of breaking. It becomes unwieldy from a developer’s point of view. From a business perspective, it stops you from growing. Why? Because if I have a new business that I want to add on — for instance, if I’m doing equities and I want to start to trade options — then I’ve got to figure out how to cut a hole in this big monolith and somehow insert some new code in there. I’m bolting things onto it. If I keep bolting things onto it, eventually it just becomes a Frankenstein.","774c6375fd150","774c6375fd15",[],{"_key":273,"markDefs":274,"children":275,"_type":49,"style":171},"9de61ede5097",[],[276],{"_type":62,"marks":277,"text":278,"_key":279},[168],"It sounds like the pendulum went too far, from the fragmented version to the monolith. What did you build next?","9de61ede50970",{"_type":49,"style":50,"_key":281,"markDefs":282,"children":283},"e0ff3fdabac4",[],[284],{"text":285,"_key":286,"_type":62,"marks":287},"This is what we’re doing at Clear Street. The new architecture that we’re building with microservices allows you to make small functional units that do something very specific, but they all talk in a common language and share a common repository in terms of the data that they update. Microservices is the first part of this new approach, and the common language, what we call messaging, is the second part.","e0ff3fdabac40",[],{"markDefs":289,"children":290,"_type":49,"style":50,"_key":294},[],[291],{"_type":62,"marks":292,"text":127,"_key":293},[],"b17d34709cab0","b17d34709cab",{"children":296,"_type":49,"style":50,"_key":301,"markDefs":302},[297],{"_type":62,"marks":298,"text":299,"_key":300},[],"There can be a little service that’s going to do trade capture, and this service’s job in life is to be able to talk to all different types of external sources to pull in trade data, and then capture it in a way that normalizes it and then passes it down on a message tube. It screams that down the line saying, “Hey, here’s a trade.” There’s a normalized version of what a trade looks like, and any service downstream of that can do anything it wants with that data. The service that’s going to do the matching with NSCC can listen to that same stream, and its job in life is just to match that trade against what NSCC knows. It listens to the same trade stream that the trade capture service is pouring out, and once it’s matched them it’s going to feed that back on another stream saying, “Hey, these are all matched. Anybody interested in which trades are matched can listen to that stream and get that from there.”","a006af57ff090","a006af57ff09",[],{"style":50,"_key":304,"markDefs":305,"children":306,"_type":49},"777f8ac75253",[],[307],{"_type":62,"marks":308,"text":127,"_key":309},[],"777f8ac752530",{"_key":311,"markDefs":312,"children":313,"_type":49,"style":50},"81a6d76c6f89",[],[314],{"_type":62,"marks":315,"text":316,"_key":317},[],"What this gives us is the ability to have a structured communication between all our services, and allows us to make our services nice and small. The logic within a given service can be upgraded, and as long as the interface coming into it and the interface going out if it remain constant, everything is fine.","81a6d76c6f890",{"_type":49,"style":50,"_key":319,"markDefs":320,"children":321},"ab85c8187031",[],[322],{"marks":323,"text":127,"_key":324,"_type":62},[],"ab85c81870310",{"style":50,"_key":326,"markDefs":327,"children":328,"_type":49},"6069597cecf9",[],[329],{"text":330,"_key":331,"_type":62,"marks":332},"Upgrades are now easy. Say the NSCC service previously did trade matching on quantity and amount, but it’s due to be upgraded to match on price, as well. As a developer, I can go into that little service and I can change a piece of code to accomplish that, without touching anything else in the overarching system or in any of the other functions. I can add on options, with very minimal ripple effect throughout the system.","6069597cecf90",[],{"markDefs":334,"children":335,"_type":49,"style":171,"_key":340},[],[336],{"_type":62,"marks":337,"text":338,"_key":339},[168],"That covers functionality. What happens, though, when more capacity, or less capacity, is desired?","893e31cc45510","893e31cc4551",{"markDefs":342,"children":343,"_type":49,"style":50,"_key":348},[],[344],{"_type":62,"marks":345,"text":346,"_key":347},[],"I’m describing architecture that we’re using, which solves a couple of the problems that we had in our first two iterations. The other main problem that both our initial iterations had was they were all housed on internal servers on internal hardware. You had to own the hardware, you had to own the data centers, and you had to maintain it all. As you grew your business, you needed to get bigger and bigger and bigger machines, right? More real estate, more power, more cost, right? And then once you had that, you were stuck with it. It’s not like you could, if you start doing less traffic or you want to downsize in some way, just get rid of those servers. You bought them, so they’re yours.","0c6bef5e69d50","0c6bef5e69d5",{"_key":350,"markDefs":351,"children":352,"_type":49,"style":50},"5a1a9c540f4a",[],[353],{"marks":354,"text":127,"_key":355,"_type":62},[],"5a1a9c540f4a0",{"_key":357,"markDefs":358,"children":359,"_type":49,"style":50},"d55f679a374b",[],[360],{"_key":361,"_type":62,"marks":362,"text":363},"d55f679a374b0",[],"Also, every two or three years, the processors change, you have to go through this whole elaborate conversion effort where you’re bringing new hardware, you test it, you make sure it’s working, you do parallel for a year, and then you switch over. So your whole time to cycle to new hardware becomes its own big project, and a big resource hog.",{"children":365,"_type":49,"style":50,"_key":369,"markDefs":370},[366],{"_key":367,"_type":62,"marks":368,"text":127},"739969d2c6850",[],"739969d2c685",[],{"children":372,"_type":49,"style":50,"_key":377,"markDefs":378},[373],{"_type":62,"marks":374,"text":375,"_key":376},[],"The answer to this, the third part of the architecture we’re doing, is not only the microservices with messaging, but we’re hosting it on a cloud service. With cloud hosting, we can quickly spin up more resources as we need them, and we can spin down resources. We can scale up and down quickly.","53edc5b07cd30","53edc5b07cd3",[],{"_type":49,"style":50,"_key":380,"markDefs":381,"children":382},"add8713cd0fd",[],[383],{"_type":62,"marks":384,"text":127,"_key":385},[],"add8713cd0fd0",{"children":387,"_type":49,"style":50,"_key":392,"markDefs":393},[388],{"_type":62,"marks":389,"text":390,"_key":391},[],"The sort of scaling that’s important is if you suddenly have a spike in volume, which we’ve had in this last year or so. In a traditional non-cloud implementation, you’re going to be scrambling, rushing in some new hardware. There’s a risk to doing that, because new hardware doesn’t always work right off the bat. Housing microservices entirely in the cloud means we can expand our footprint very quickly to handle spikes, and then we can downgrade back so we save money. That’s the third ingredient to what the new iteration of a clearing system looks like.","deec99fd67930","deec99fd6793",[],{"children":395,"_type":49,"style":171,"_key":400,"markDefs":401},[396],{"_type":62,"marks":397,"text":398,"_key":399},[168],"Can you give a number to how many independent microservices we’re talking about?","9ccb1e5d74fa0","9ccb1e5d74fa",[],{"markDefs":403,"children":404,"_type":49,"style":50,"_key":409},[],[405],{"_type":62,"marks":406,"text":407,"_key":408},[],"So we’re at the mid-level right now. I think we’ve got 30 to 50 microservices. Once we’ve got all the functionality, that’s going to go to somewhere around the 100 mark, maybe more. We’re not talking thousands. To qualify, I’m talking about a hundred or so different specific microservices doing their function, their task. What the cloud allows you to do is spin up multiple instances of that service. You might have tens or hundreds of iterations of specific services if you need that volume of throughput.","421802c47d200","421802c47d20",{"_key":411,"markDefs":412,"children":413,"_type":49,"style":171},"72f777f38dac",[],[414],{"_type":62,"marks":415,"text":416,"_key":417},[168],"You used a similar word to describe both the early, fragmented approach and the later, monolithic approach: “unwieldy.” Can you look ahead and foresee what issues the cloud microservices approach might face?","72f777f38dac0",{"_type":49,"style":50,"_key":419,"markDefs":420,"children":421},"b1ae849a276d",[],[422],{"_key":423,"_type":62,"marks":424,"text":425},"b1ae849a276d0",[],"One thing we’ve come across is microservice bloat. That’s where you start building a microservice, and you realize it’s got to do too many things. At some point you have to recognize it’s becoming unwieldy, and break it up. If you don’t keep an eye on it, it can sneak up on you. You have to recognize when it’s time to break a microservice into two or more distinct microservices.",{"children":427,"_type":49,"style":171,"_key":432,"markDefs":433},[428],{"_type":62,"marks":429,"text":430,"_key":431},[168],"For context, can you briefly go back further in time tell the story of what the COBOL era supplanted?","7ef1756952040","7ef175695204",[],{"markDefs":435,"children":436,"_type":49,"style":50,"_key":441},[],[437],{"_type":62,"marks":438,"text":439,"_key":440},[],"Paper. That’s what COBOL fixed, or at least helped address. People had paper sheets and they would exchange papers between each other. Then they would compare those, and there were adding machines, and they would write down the results. And paper persists. It continued through the COBOL era, and even today physical stocks still exist, though not as widely as they used to. You still have these people on the street called runners who actually have pouches containing the stocks. They run down to the DTC window, and actually hand over the stocks in person. Somebody sits there and counts the stocks and ticks them off. Before we had the computerized version of clearing systems, that’s how all stocks were handled. There was a big ledger where they kept track of everything.","af88959bb4420","af88959bb442",{"markDefs":443,"children":444,"_type":49,"style":50,"_key":448},[],[445],{"_type":62,"marks":446,"text":127,"_key":447},[],"f93ba20194d20","f93ba20194d2",{"markDefs":450,"children":451,"_type":49,"style":50,"_key":456},[],[452],{"text":453,"_key":454,"_type":62,"marks":455},"Back then we had a two-weeks settlement cycle due to all the literal paperwork. And back then, the only place this was happening was actually on Wall Street. People were physically in the same vicinity so they would easily be able to exchange paperwork. You can’t scale that, right? It doesn’t matter how many clerks, the process just won’t go any faster.","9add00e2b80d0",[],"9add00e2b80d",{"style":50,"_key":458,"markDefs":459,"children":460,"_type":49},"14ce39ac28bb",[],[461],{"text":127,"_key":462,"_type":62,"marks":463},"14ce39ac28bb0",[],{"markDefs":465,"children":466,"_type":49,"style":50,"_key":471},[],[467],{"_type":62,"marks":468,"text":469,"_key":470},[],"Even on the clearing side, today, there is still physical stock, which has to be put in a vault. One of the regulatory bodies has this rule that, to this day, you have to do a quarterly vault count. Back at my old firm, we had a really big vault, packed with physicals. We were one of the few firms that could manage the work. We called it “all hands on deck.” Everybody would sit at their desk, the vault would be taken out, and then they’d dump a bunch of stocks on your desk and you and write it all down, and then somebody would go around, get everybody’s recording, tally it, and then compare it to the electronic stock record. They would have to make sure that what’s physically in the vault and what you had recorded align. The chief compliance officer would then sign that vault count into the SEC and say, “Yep, we counted them physically and they all match.”","9a8dfbb6aa5d0","9a8dfbb6aa5d",{"_type":49,"style":50,"_key":473,"markDefs":474,"children":475},"d3a86bc0beb9",[],[476],{"_type":62,"marks":477,"text":127,"_key":478},[],"d3a86bc0beb90",{"_type":49,"style":50,"_key":480,"markDefs":481,"children":482},"b0237ab8a940",[],[483],{"_type":62,"marks":484,"text":485,"_key":486},[],"We’ve come a long way.","b0237ab8a9400",[],[489,497],{"children":490,"_type":49,"style":50,"_key":495,"markDefs":496},[491],{"_type":62,"marks":492,"text":493,"_key":494},[168],"About Clear Street:","820e76cb468a0","01d9743bd6e6",[],{"_key":498,"markDefs":499,"children":503,"_type":49,"style":50},"6558fb161935",[500],{"href":501,"_key":502,"_type":54},"https://clearstreet.io","f69e401d33e9",[504,508,511],{"text":505,"_key":506,"_type":62,"marks":507},"Clear Street is modernizing the brokerage ecosystem with financial technology and services that empower market participants with real-time data and best-in-class products, tools and teams, to navigate capital markets around the world. Complemented by white-glove service, Clear Street's cloud-native, proprietary product suite delivers financing, derivatives, execution and more to power client success, adding efficiency to the market and enabling clients to minimize risk, redundancy and cost. Clear Street’s goal is to create a single platform for every asset class, in every country and in any currency. For more information, visit ","46cc6bc340df0",[],{"_type":62,"marks":509,"text":501,"_key":510},[502],"46cc6bc340df1",{"_type":62,"marks":512,"text":513,"_key":514},[],".","46cc6bc340df2",{"footerItems":516,"legalItems":548,"legalText":10,"socialNetworks":558,"address":576,"disclaimer":577},[517,530,542],{"title":111,"pages":518},[519,523,526,529],{"type":520,"title":521,"slug":522},"internal","About","about",{"type":520,"title":524,"slug":525},"News & Content","news",{"type":520,"title":527,"slug":528},"Careers","careers",{"type":520,"title":91,"slug":92},{"title":531,"pages":532},"Services",[533,536,539],{"type":520,"title":534,"slug":535},"Institutional","institutional",{"type":520,"title":537,"slug":538},"Professional Clearing","professional-clearing",{"type":520,"title":540,"slug":541},"Active Trader","active-trader",{"title":543,"pages":544},"Products",[545],{"type":520,"title":546,"slug":547},"Studio","studio",[549,552,555],{"title":550,"slug":551},"Regulatory Disclosures","regulatory-disclosures",{"title":553,"slug":554},"Privacy Policy","privacy-policy",{"title":556,"slug":557},"Security","security",[559,564,568,572],{"_type":560,"link":561,"socialNetwork":562,"_key":563},"links","https://github.com/clear-street","github","466192507eea",{"link":565,"socialNetwork":566,"_key":567,"_type":560},"https://www.linkedin.com/company/clear-street","linkedin","43f9fa8f49d0",{"_key":569,"_type":560,"link":570,"socialNetwork":571},"b581a744d770","https://www.youtube.com/@ClearStreetNYC","youtube",{"_type":560,"link":573,"socialNetwork":574,"_key":575},"https://open.spotify.com/show/3Bbl6x17ZSdnijTTDq6tKi","spotify","7625c0ffc2b2","4 World Trade Center\n150 Greenwich St Floor 45\nNew York, NY 10007\n(646) 845-0036",[578,588],{"markDefs":579,"children":582,"_type":49,"style":50,"_key":587},[580],{"_key":581,"_type":54,"href":55},"d38625939708",[583],{"_type":62,"marks":584,"text":585,"_key":586},[],"Products and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. ","331699fdb6140","b41b74ae73bb",{"children":589,"_type":49,"style":50,"_key":601,"markDefs":602},[590,594,597],{"_type":62,"marks":591,"text":592,"_key":593},[],"Additional information about Clear Street is available on FINRA ","42e587e4d749",{"_type":62,"marks":595,"text":69,"_key":596},[581],"4894062c01ca",{"_type":62,"marks":598,"text":599,"_key":600},[],", including its Customer Relationship Summary and NFA BASIC | NFA (futures.org).","6db9006e1b4a","dbec5081eda7",[603],{"_type":54,"href":55,"_key":581},1733511758109]