[{"data":1,"prerenderedAt":488},["ShallowReactive",2],{"pTKmcM0XlZ":3},{"pageSetup":4,"sections":15},{"title":5,"slug":6,"description":9,"keywords":10,"image":11},"Building a Risk Platform for the Modern Markets",{"current":7,"_type":8},"building-a-risk-platform-for-the-modern-markets","slug","Clear Street is a cloud-native financial technology firm on a mission to modernize the brokerage ecosystem.",null,{"url":12,"width":13,"height":14},"https://cdn.sanity.io/images/40fnhjbe/production/7f190e17f89ea827b2d25d1c5ee01969bf69b781-3840x2160.png",3840,2160,{"header":16,"content":39,"footer":399},{"author":17,"category":34,"title":5,"date":37,"summary":9,"hello":38},{"_type":18,"_updatedAt":19,"role":20,"_createdAt":21,"slug":22,"name":24,"photo":25,"_id":32,"_rev":33},"authors","2024-05-30T15:04:08Z","","2024-02-16T14:38:42Z",{"current":23,"_type":8},"clear-street","Clear Street",{"width":26,"height":26,"extension":27,"alt":10,"hotspot":10,"asset":28,"url":31},480,"png",{"_ref":29,"_type":30},"image-f9f54b5f5240dfdb9749b6abea1e0ea4720c0dee-480x480-png","reference","https://cdn.sanity.io/images/40fnhjbe/production/f9f54b5f5240dfdb9749b6abea1e0ea4720c0dee-480x480.png","3vmxkk46kHuWSrwZ2It9t9","oquihqXh9OzAvkinFGpsSM",{"name":35,"colorSlug":36},"Culture","culture","2022-03-02","world",{"legalText":40,"form":83,"type":112,"readingTime":113,"body":114,"references":371,"pressReleasesFootNote":372},[41,75],{"_key":42,"markDefs":43,"children":51,"_type":73,"style":74},"cd3115128082",[44,48],{"_key":45,"_type":46,"href":47},"10659f16c05f","link","https://brokercheck.finra.org/firm/summary/288933",{"_key":49,"_type":46,"href":50},"3c111ef5e988","https://www.nfa.futures.org/BasicNet/basic-profile.aspx?nfaid=XCoGScQYyvw%3D",[52,57,61,65,69],{"_type":53,"marks":54,"text":55,"_key":56},"span",[],"Clear Street does not provide investment, legal, regulatory, tax, or compliance advice. Consult professionals in these fields to address your specific circumstances. These materials are: (i) solely an overview of Clear Street’s products and services; (ii) provided for informational purposes only; and (iii) subject to change without notice or obligation to replace any information contained therein.\n\nProducts and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. Additional information about Clear Street is available on FINRA ","e217f565c4110",{"_key":58,"_type":53,"marks":59,"text":60},"e217f565c4111",[45],"BrokerCheck",{"_type":53,"marks":62,"text":63,"_key":64},[],", including its Customer Relationship Summary and NFA ","e217f565c4112",{"_key":66,"_type":53,"marks":67,"text":68},"e217f565c4113",[49],"BASIC | NFA (futures.org)",{"_type":53,"marks":70,"text":71,"_key":72},[],".\n‍\nCopyright © 2024 Clear Street LLC. All rights reserved. Clear Street and the Shield Logo are Registered Trademarks of Clear Street LLC\n","e217f565c4114","block","normal",{"style":74,"_key":76,"markDefs":77,"children":78,"_type":73},"38805a72b34d",[],[79],{"text":80,"_key":81,"_type":53,"marks":82},"\n","a19adde9170f0",[],{"title":84,"slug":85,"fields":86},"Contact","contact",[87,93,98,103,107],{"required":88,"errorMessage":89,"_type":90,"name":91,"label":92},true,"Please add your full name","field.string","full-name","Full name",{"name":94,"label":95,"required":88,"errorMessage":96,"_type":97},"work-email","Work email","Invalid email","field.email",{"required":88,"errorMessage":99,"_type":100,"name":101,"label":102},"Please add your work phone","field.phone","work-phone","Work phone",{"label":104,"required":88,"errorMessage":105,"_type":90,"name":106},"Company","Please add your company","company",{"name":108,"label":109,"required":110,"errorMessage":10,"_type":111},"message","Message (optional)",false,"field.text","blog",9,[115,124,131,139,157,164,172,181,193,200,208,215,223,230,238,246,258,265,273,281,292,299,307,315,326,333,341,348,356,363],{"style":116,"_key":117,"markDefs":118,"children":119,"_type":73},"h5","b69ffcb1da42",[],[120],{"_type":53,"marks":121,"text":122,"_key":123},[],"A Conversation with Chief Risk Officer Nilimp Bhatt","b69ffcb1da420",{"_type":73,"style":74,"_key":125,"markDefs":126,"children":127},"012d344ccbd5",[],[128],{"_type":53,"marks":129,"text":20,"_key":130},[],"012d344ccbd50",{"_type":73,"style":74,"_key":132,"markDefs":133,"children":134},"97dee8fbddba",[],[135],{"_key":136,"_type":53,"marks":137,"text":138},"97dee8fbddba0",[],"The past 12 months have been a referendum on risk management in prime brokerage, and markets today continue to feel the effects of the past two years’ volatility. And yet, we only seem to talk about risk strategies and practices after some type of problem has occurred: a major blow-up, a firm failure, an insanely high margin call. And those discussions tend to be finger-pointing (who was asleep at the wheel?) or forensic (what went wrong?). We look for bad data that led to a major collapse or laissez faire management that let something slip through the cracks. Once we’ve found something or someone to blame, we go back to our daily business with little reflection on our own risk management practices.",{"extension":140,"_key":141,"asset":142,"children":10,"height":144,"width":145,"hotspot":10,"_type":146,"alt":147,"caption":148,"url":156},"jpg","43acbfc28e25",{"_ref":143,"_type":30},"image-97554496f45fe80ad64e83ce64a44b2fd3c644ec-1400x933-jpg",933,1400,"figureNews","Nilimp Bhatt, Brad Bailey",[149],{"_key":150,"markDefs":151,"children":152,"_type":73,"style":74},"3d9a404221d3",[],[153],{"_type":53,"marks":154,"text":147,"_key":155},[],"3d9a404221d30","https://cdn.sanity.io/images/40fnhjbe/production/97554496f45fe80ad64e83ce64a44b2fd3c644ec-1400x933.jpg",{"children":158,"_type":73,"style":74,"_key":162,"markDefs":163},[159],{"_type":53,"marks":160,"text":20,"_key":161},[],"67b522a276fe0","67b522a276fe",[],{"_key":165,"markDefs":166,"children":167,"_type":73,"style":74},"5fd08e3bba27",[],[168],{"marks":169,"text":170,"_key":171,"_type":53},[],"Wouldn’t it be more useful to talk about risk before the problems arise? During a recent moment of relative calm, I spoke with Clear Street’s Chief Risk Officer, Nilimp Bhatt, about how his team thinks about and manages risk — in the good times and the bad. In the following Q&A, Nilimp and I discuss recent hard-won lessons, the evolution of risk management, and what we mean by “best-in-class” risk management at Clear Street.","5fd08e3bba270",{"_key":173,"markDefs":174,"children":175,"_type":73,"style":116},"c91b05633915",[],[176],{"marks":177,"text":179,"_key":180,"_type":53},[178],"strong","Q: Let’s set the stage. Nilimp, tell us about your experience as a risk manager. How do you think about risk? What is your guiding philosophy?","c91b056339150",{"markDefs":182,"children":183,"_type":73,"style":74,"_key":192},[],[184,188],{"_type":53,"marks":185,"text":186,"_key":187},[178],"NB: ","77fe591d2dee0",{"text":189,"_key":190,"_type":53,"marks":191},"The markets have evolved significantly over the last three to five years. We’ve seen a lot more volatility driven by numerous forces — for example, the “retail army,” particularly in meme stocks and within the options market. The landscape is constantly evolving with newer players, newer strategies, newer products. Risk management has to keep pace with all that. It must evolve in sync with how the markets are evolving.","77fe591d2dee1",[],"77fe591d2dee",{"style":74,"_key":194,"markDefs":195,"children":196,"_type":73},"91ffed7d04bc",[],[197],{"_type":53,"marks":198,"text":20,"_key":199},[],"91ffed7d04bc0",{"_type":73,"style":74,"_key":201,"markDefs":202,"children":203},"0f9459885c34",[],[204],{"_type":53,"marks":205,"text":206,"_key":207},[],"For that to happen, a risk management group must have visibility and transparency into the positions and the risk evolution of a client’s portfolio on a real-time basis. That’s priority number one for us at Clear Street. We need to have complete transparency and visibility into how clients’ books are evolving, their PNL, their positions, their risks, and so on. That knowledge gives our risk management team, and the firm as a whole, the edge to navigate through volatile times in a much better and informed way.","0f9459885c340",{"_key":209,"markDefs":210,"children":211,"_type":73,"style":74},"a0e401df9ffd",[],[212],{"_type":53,"marks":213,"text":20,"_key":214},[],"a0e401df9ffd0",{"style":74,"_key":216,"markDefs":217,"children":218,"_type":73},"7343ee4b0787",[],[219],{"_key":220,"_type":53,"marks":221,"text":222},"7343ee4b07870",[],"The other thing I’ve learned is the importance of a robust yet flexible risk platform that can support different types of strategies, different types of products, and different types of margin regimes. We are working to build a one-stop-shop risk platform that can meet the needs of clients across markets and asset classes.",{"markDefs":224,"children":225,"_type":73,"style":74,"_key":229},[],[226],{"_type":53,"marks":227,"text":20,"_key":228},[],"95c7d3c2b6730","95c7d3c2b673",{"children":231,"_type":73,"style":74,"_key":236,"markDefs":237},[232],{"_type":53,"marks":233,"text":234,"_key":235},[],"That goal, what we’re building, is in stark contrast to the current prime brokerage model where you have to open up five different systems to meet the needs of one client portfolio, simply because that portfolio happens to comprise multiple products in multiple geographies and markets. These types of portfolios, global and trading across different asset classes, tend to be margined on multiple platforms because institutions don’t have the right technology to service all of their clients’ needs. At Clear Street, we want to do it the right way. To be successful, you need to know your client and the client needs to know you and your threshold for a successful long-term prime brokerage relationship.","7ef8595039d00","7ef8595039d0",[],{"children":239,"_type":73,"style":116,"_key":244,"markDefs":245},[240],{"marks":241,"text":242,"_key":243,"_type":53},[178],"Q: I’ve found the firms with the strongest risk management have risk fully integrated into their day-to-day operations. Risk isn’t siloed away, but rather an essential and active part of the firm’s culture and operating model. How do you think about risk integration at Clear Street?","bd497adfbcb70","bd497adfbcb7",[],{"markDefs":247,"children":248,"_type":73,"style":74,"_key":257},[],[249,253],{"_key":250,"_type":53,"marks":251,"text":252},"7275381c57250",[178],"NB:",{"_type":53,"marks":254,"text":255,"_key":256},[]," I would call risk at Clear Street a highly centric function. We touch all different departments within Clear Street, and look at many aspects of risk management including market risk, counterparty credit risk, liquidity risk, and execution risk, among others. We are the team facing the regulators, getting them comfortable with how we manage risk at the firm. We are also the people interacting with our clients to understand their leverage or offer insight on how we would margin different strategies that they want to put on our platform.","7275381c57251","7275381c5725",{"_type":73,"style":74,"_key":259,"markDefs":260,"children":261},"403d78e13504",[],[262],{"text":20,"_key":263,"_type":53,"marks":264},"403d78e135040",[],{"_type":73,"style":74,"_key":266,"markDefs":267,"children":268},"28e56ee17d2b",[],[269],{"_type":53,"marks":270,"text":271,"_key":272},[],"The team right now is a group of eight risk managers, all from different institutions. We have senior and seasoned risk managers who’ve spent time at Goldman Sachs, Bank of America, Fidelity, and some of the other institutions that have a big prime brokerage presence. We also have a risk engineering team who are helping us build that one-stop-shop, real-time risk platform. These engineers come from some of the top tech firms out there and are helping us create a modern, high quality platform for our clients. In the long term, we want to grow globally to make sure that there is global coverage 24/7. It’s all about making sure we are providing that one-stop solution for our clients.","28e56ee17d2b0",{"children":274,"_type":73,"style":116,"_key":279,"markDefs":280},[275],{"_type":53,"marks":276,"text":277,"_key":278},[178],"Q: Even with risk fully integrated into the business, unexpected market events will happen and cause stress for our team and our clients. How do you think about navigating those surprise situations? Can you ever truly be prepared for the next GameStop?","028c657d7a6d0","028c657d7a6d",[],{"style":74,"_key":282,"markDefs":283,"children":284,"_type":73},"30ccd6d7b024",[],[285,288],{"text":186,"_key":286,"_type":53,"marks":287},"30ccd6d7b0240",[178],{"_type":53,"marks":289,"text":290,"_key":291},[],"Being proactive is key to risk management. Exactly as you point out, we most often hear about risk when firms are scrambling to take reactive measures after something blows up. Then people start raising margin, people start collecting more collateral, which is obviously natural and human, but we don’t do that — that’s not how we operate at Clear Street. When something goes wrong, we take a step back and we think within our risk framework and ask questions. How can we be proactive about this? What could be the next meme stock? What are some of the attributes which made GME into GME and AMC into AMC? We don’t have a crystal ball, but we can identify patterns and trends to help us predict, or at least be prepared for, the next market event.","30ccd6d7b0241",{"_key":293,"markDefs":294,"children":295,"_type":73,"style":74},"1588e5aecfea",[],[296],{"_type":53,"marks":297,"text":20,"_key":298},[],"1588e5aecfea0",{"style":74,"_key":300,"markDefs":301,"children":302,"_type":73},"c95d23e231c9",[],[303],{"_type":53,"marks":304,"text":305,"_key":306},[],"That’s the key to risk management: try to be proactive, try to look for scenarios that haven’t happened in the past, and run, run, run scenarios. A lot of risk management originally was based on historical analysis. People would say, what happens if such and such were to happen again? What would happen if the Gulf Crisis were to happen again? But that’s never happened again. You can’t plan for the future by looking backward. When 2008 happened, that was the first time it happened. When COVID-19 happened, that was the first time the market was hit by 20% in a month and then boom, it came back 20% in the next month. History isn’t enough. You need to run scenarios that you think could potentially happen in the future, rather than simply reflect on what’s already happened. And that’s what we try to do at Clear Street, what gives us the edge.","c95d23e231c90",{"style":116,"_key":308,"markDefs":309,"children":310,"_type":73},"0a52d7197124",[],[311],{"marks":312,"text":313,"_key":314,"_type":53},[178],"Q: Tell me more about that. What is our “edge” at Clear Street?","0a52d71971240",{"children":316,"_type":73,"style":74,"_key":324,"markDefs":325},[317,320],{"_type":53,"marks":318,"text":252,"_key":319},[178],"640ab57e29910",{"_type":53,"marks":321,"text":322,"_key":323},[]," Real-time views. Plain and simple. Insight into real-time risk is the biggest tool a risk manager can have because it enables greater proactivity and helps our clients be more competitive in the market. We can see clients putting on positions and markets moving against them in real-time. We call them right away saying, “You need to cut down this risk.” As we build out our platform, we are working hard to share that tool, that real-time visibility, with our clients. We want our clients to have the same visibility and the same tools that we have as a prime broker.","640ab57e29911","640ab57e2991",[],{"markDefs":327,"children":328,"_type":73,"style":74,"_key":332},[],[329],{"_type":53,"marks":330,"text":20,"_key":331},[],"a154711d7c060","a154711d7c06",{"_key":334,"markDefs":335,"children":336,"_type":73,"style":74},"4c9311a85917",[],[337],{"_type":53,"marks":338,"text":339,"_key":340},[],"I cannot tell you how many clients have told us that this would be number one on their wishlist. Obviously they knew that getting that from a bigger institution — which to the point made earlier, is built on legacy infrastructure — is almost a pipe dream. But they would say that is the need of the hour: “We’d love to have the same views you do.”","4c9311a859170",{"style":74,"_key":342,"markDefs":343,"children":344,"_type":73},"eacf3f9ed907",[],[345],{"_type":53,"marks":346,"text":20,"_key":347},[],"eacf3f9ed9070",{"_type":73,"style":74,"_key":349,"markDefs":350,"children":351},"92c9aa64254d",[],[352],{"_type":53,"marks":353,"text":354,"_key":355},[],"There is often an assumption that all prime brokerage clients are sophisticated and have the same tech builds — but that’s a false assumption. Many of them, particularly emerging managers who are just getting started, don’t have a full suite of resources at their fingertips. A few of them have their own views, but they want to sync up with the prime broker so that they see the same way we do. We are critical partners in their growth.","92c9aa64254d0",{"_key":357,"markDefs":358,"children":359,"_type":73,"style":74},"262125f28738",[],[360],{"_type":53,"marks":361,"text":20,"_key":362},[],"262125f287380",{"_type":73,"style":74,"_key":364,"markDefs":365,"children":366},"497325bd6fb4",[],[367],{"_type":53,"marks":368,"text":369,"_key":370},[],"For us, as a prime broker, to give them a platform that allows them to view risk in real-time the same way we do — to do what if scenarios to better understand their risk profile and margin requirements — that is going to be a game changer.","497325bd6fb40",[],[373,381],{"_type":73,"style":74,"_key":374,"markDefs":375,"children":376},"01d9743bd6e6",[],[377],{"text":378,"_key":379,"_type":53,"marks":380},"About Clear Street:","820e76cb468a0",[178],{"style":74,"_key":382,"markDefs":383,"children":387,"_type":73},"6558fb161935",[384],{"_type":46,"href":385,"_key":386},"https://clearstreet.io","f69e401d33e9",[388,392,395],{"_key":389,"_type":53,"marks":390,"text":391},"46cc6bc340df0",[],"Clear Street is modernizing the brokerage ecosystem with financial technology and services that empower market participants with real-time data and best-in-class products, tools and teams, to navigate capital markets around the world. Complemented by white-glove service, Clear Street's cloud-native, proprietary product suite delivers financing, derivatives, execution and more to power client success, adding efficiency to the market and enabling clients to minimize risk, redundancy and cost. Clear Street’s goal is to create a single platform for every asset class, in every country and in any currency. For more information, visit ",{"marks":393,"text":385,"_key":394,"_type":53},[386],"46cc6bc340df1",{"_type":53,"marks":396,"text":397,"_key":398},[],".","46cc6bc340df2",{"disclaimer":400,"footerItems":427,"legalItems":459,"legalText":10,"socialNetworks":469,"address":487},[401,411],{"markDefs":402,"children":405,"_type":73,"style":74,"_key":410},[403],{"href":47,"_key":404,"_type":46},"d38625939708",[406],{"_type":53,"marks":407,"text":408,"_key":409},[],"Products and services are offered by Clear Street LLC as a Broker Dealer member FINRA and SIPC and a Futures Commission Merchant registered with the CFTC and member of NFA. ","331699fdb6140","b41b74ae73bb",{"_key":412,"markDefs":413,"children":415,"_type":73,"style":74},"dbec5081eda7",[414],{"href":47,"_key":404,"_type":46},[416,420,423],{"_type":53,"marks":417,"text":418,"_key":419},[],"Additional information about Clear Street is available on FINRA ","42e587e4d749",{"_type":53,"marks":421,"text":60,"_key":422},[404],"4894062c01ca",{"_type":53,"marks":424,"text":425,"_key":426},[],", including its Customer Relationship Summary and NFA BASIC | NFA (futures.org).","6db9006e1b4a",[428,441,453],{"title":104,"pages":429},[430,434,437,440],{"type":431,"title":432,"slug":433},"internal","About","about",{"type":431,"title":435,"slug":436},"News & Content","news",{"type":431,"title":438,"slug":439},"Careers","careers",{"type":431,"title":84,"slug":85},{"title":442,"pages":443},"Services",[444,447,450],{"type":431,"title":445,"slug":446},"Institutional","institutional",{"type":431,"title":448,"slug":449},"Professional Clearing","professional-clearing",{"type":431,"title":451,"slug":452},"Active Trader","active-trader",{"title":454,"pages":455},"Products",[456],{"type":431,"title":457,"slug":458},"Studio","studio",[460,463,466],{"title":461,"slug":462},"Regulatory Disclosures","regulatory-disclosures",{"title":464,"slug":465},"Privacy Policy","privacy-policy",{"title":467,"slug":468},"Security","security",[470,475,479,483],{"_type":471,"link":472,"socialNetwork":473,"_key":474},"links","https://github.com/clear-street","github","466192507eea",{"_type":471,"link":476,"socialNetwork":477,"_key":478},"https://www.linkedin.com/company/clear-street","linkedin","43f9fa8f49d0",{"_type":471,"link":480,"socialNetwork":481,"_key":482},"https://www.youtube.com/@ClearStreetNYC","youtube","b581a744d770",{"_type":471,"link":484,"socialNetwork":485,"_key":486},"https://open.spotify.com/show/3Bbl6x17ZSdnijTTDq6tKi","spotify","7625c0ffc2b2","4 World Trade Center\n150 Greenwich St Floor 45\nNew York, NY 10007\n(646) 845-0036",1733511756680]